Tester1cExpansion/src/InformationRegisters/Киур_ЗначениеКонстант_8_3_15/Киур_ЗначениеКонстант_8_3_15.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Киур_ЗначениеКонстант_8_3_15</name>
  <attributes>
    <name>ЗначениеКонстанты</name>
    <type>
      <types>Number</types>
      <types>String</types>
      <types>Date</types>
      <types>Boolean</types>
      <types>CatalogRef.Киур_СоединенияADODB</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяКонстанты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester1cExpansion/src/InformationRegisters/Киур_ЗначениеКонстант_8_3_15/ManagerModule.bsl
//В расширения нельзя пихать константы для версий 8.3.15 и ниже.

Функция ПолучитьЗначениеКонстанты(ФиксированныеПараметры, МодифицируемыеПараметры = Неопределено) ЭКСПОРТ
	 
	Если ТипЗнч(МодифицируемыеПараметры) <> Тип("Структура") Тогда
		МодифицируемыеПараметры = новый Структура;	
	КонецЕсли;	 
	
	ИмяКонстанты = ФиксированныеПараметры.ИмяКонстанты;
	ЗначениеПоУмолчанию = ФиксированныеПараметры.ЗначениеПоУмолчанию;
	
	ЗначениеКонстанты = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Киур_ЗначениеКонстант_8_3_15.ЗначениеКонстанты
		|ИЗ
		|	РегистрСведений.Киур_ЗначениеКонстант_8_3_15 КАК Киур_ЗначениеКонстант_8_3_15
		|ГДЕ
		|	Киур_ЗначениеКонстант_8_3_15.ИмяКонстанты = &ИмяКонстанты";
	
	Запрос.УстановитьПараметр("ИмяКонстанты", ИмяКонстанты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗначениеКонстанты = ВыборкаДетальныеЗаписи.ЗначениеКонстанты;
	КонецЕсли;
	
	Если ЗначениеКонстанты = Неопределено Тогда
				
		ЗначениеКонстанты = ЗначениеПоУмолчанию;
		СообщениеОшибки = "В регистре констант отсутствует значение для константы: " + ИмяКонстанты;
		СообщениеОшибки = СообщениеОшибки + Символы.ПС + "Возврат значения по умолчанию: " + ЗначениеПоУмолчанию;
		
		Сообщение = новый СообщениеПользователю();
		Сообщение.Текст = СообщениеОшибки;		
		Сообщение.Сообщить();
		
		МодифицируемыеПараметры.Вставить("СообщениеОшибки",СообщениеОшибки);
		
	КонецЕсли;	
	
	Возврат ЗначениеКонстанты;
	
КонецФункции
